Revit 2027 API
SubTransaction.HasStarted Method
 Determines whether the sub-transaction has been started yet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasStarted()
Public Function HasStarted As Boolean
public:
bool HasStarted()
member HasStarted : unit -> bool
Return Value
Boolean
 True if the sub-transaction has already started, False otherwise.
Remarks
 A sub-transaction is considered being started after the Start method was called and until the sub-transaction is either committed or rolled back.
See Also
Reference
SubTransaction Class
Autodesk.Revit.DB Namespace